bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp_wdr.c
#include <bl808_isp_wdr.h>
#include <isp_tg_reg.h>
#include <isp_auto_reg.h>
#include <isp_blae_reg.h>
#include <isp_blawb_reg.h>
#include <isp_gamma_reg.h>

#include <isp_front_reg.h>
#include <isp_middle_reg.h>
#include <isp_middle2_reg.h>
#include <isp_middle3_reg.h>
#include <isp_middle4_reg.h>
#include <isp_middle5_reg.h>
#include <isp_blback_reg.h>

#define ISP_WDR_ROI_WEIGHT_MAX                      (15)
#define ISP_WDR_CURVE_WEIGHT_MAX                    (16)
#define ISP_WDR_POST_ENHANCE_WEIGHT_MAX             (16)
#define ISP_WDR_POST_ENHANCE_Y_OFFSET_MAX           ((1 << 12) - 1)
#define ISP_WDR_POST_ENHANCE_Y_GAIN_MAX             ((1 << 15) - 1)
#define ISP_WDR_POST_ENHANCE_C_GAIN_MAX             ((1 << 15) - 1)


void ISP_WDR_Get_WDR_State(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_0);

    if (BL_IS_REG_BIT_SET(tmpVal, ISP_BLBACK_WDR_EN_PRE)) {
        *state = ENABLE;
    } else {
        *state = DISABLE;
    }
}

void ISP_WDR_Set_WDR_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_0);
    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_BLBACK_WDR_EN_PRE);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_BLBACK_WDR_EN_PRE);
    }
    BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_0, tmpVal);
}

void ISP_WDR_Set_CS_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_CS_0);
    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_BLBACK_WDR_CS_EN_PRE);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_BLBACK_WDR_CS_EN_PRE);
    }
    BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_CS_0, tmpVal);
}

void ISP_WDR_Get_CS_State(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_CS_0);

    if (BL_IS_REG_BIT_SET(tmpVal, ISP_BLBACK_WDR_CS_EN_PRE)) {
        *state = ENABLE;
    } else {
        *state = DISABLE;
    }
}

void ISP_WDR_Set_CS_Config(const ISP_Chroma_Suppress_Type *chromaSupprCfg)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_WDR_CS_GAIN_PRE, chromaSupprCfg->gain);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_0, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_CS_0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_WDR_CS_WEIGHT_PRE, chromaSupprCfg->weight);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_WDR_CS_GREY_TH_PRE, chromaSupprCfg->grey_thr);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_CS_0, tmpVal);
}

void ISP_WDR_Get_CS_Config(ISP_Chroma_Suppress_Type *chromaSupprCfg)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_0);
    chromaSupprCfg->gain = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_WDR_CS_GAIN_PRE);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_CS_0);
    chromaSupprCfg->weight = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_WDR_CS_WEIGHT_PRE);
    chromaSupprCfg->grey_thr = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_WDR_CS_GREY_TH_PRE);
}

void ISP_WDR_Set_ROI_State(int roi_id, BL_Fun_Type state)
{
    uint32_t tmpVal;

    switch(roi_id)
    {
        case 0:
        case 1:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_1);
            if (roi_id & 0x01) {
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI1_EN_PRE, state);
            } else {
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI0_EN_PRE, state);
            }
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_1, tmpVal);
            break;
        case 2:
        case 3:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_2);
            if (roi_id & 0x01) {
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI3_EN_PRE, state);
            } else {
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI2_EN_PRE, state);
            }
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_2, tmpVal);
            break;
        case 4:
        case 5:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_3);
            if (roi_id & 0x01) {
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI5_EN_PRE, state);
            } else {
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI4_EN_PRE, state);
            }
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_3, tmpVal);
            break;
        case 6:
        case 7:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_4);
            if (roi_id & 0x01) {
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI7_EN_PRE, state);
            } else {
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI6_EN_PRE, state);
            }
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_4, tmpVal);
            break;
    }
}

void ISP_WDR_Get_ROI_State(int roi_id, BL_Fun_Type *state)
{
    uint32_t tmpVal;

    switch(roi_id)
    {
        case 0:
        case 1:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_1);
            if (roi_id & 0x01) {
                tmpVal = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI1_EN_PRE);
            } else {
                tmpVal = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI0_EN_PRE);
            }
            if (tmpVal == 1) {
                *state = ENABLE;
            } else {
                *state = DISABLE;
            }
            break;
        case 2:
        case 3:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_2);
            if (roi_id & 0x01) {
                tmpVal = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI3_EN_PRE);
            } else {
                tmpVal = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI2_EN_PRE);
            }
            if (tmpVal == 1) {
                *state = ENABLE;
            } else {
                *state = DISABLE;
            }
            break;
        case 4:
        case 5:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_3);
            if (roi_id & 0x01) {
                tmpVal = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI5_EN_PRE);
            } else {
                tmpVal = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI4_EN_PRE);
            }
            if (tmpVal == 1) {
                *state = ENABLE;
            } else {
                *state = DISABLE;
            }
            break;
        case 6:
        case 7:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_4);
            if (roi_id & 0x01) {
                tmpVal = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI7_EN_PRE);
            } else {
                tmpVal = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI6_EN_PRE);
            }
            if (tmpVal == 1) {
                *state = ENABLE;
            } else {
                *state = DISABLE;
            }
            break;
    }
}

void ISP_WDR_Set_ROI_Position(int roi_id, int left_x, int right_x,
                                int top_y, int bottom_y)
{
    uint32_t tmpVal;

