bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp_wdr.c
    switch(roi_id)
    {
        case 0:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_5);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X0_MIN_PRE, left_x);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X0_MAX_PRE, right_x);
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_5, tmpVal);
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_6);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y0_MIN_PRE, top_y);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y0_MAX_PRE, bottom_y);
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_6, tmpVal);
            break;
        case 1:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_7);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X1_MIN_PRE, left_x);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X1_MAX_PRE, right_x);
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_7, tmpVal);
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_8);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y1_MIN_PRE, top_y);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y1_MAX_PRE, bottom_y);
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_8, tmpVal);
            break;
        case 2:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_9);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X2_MIN_PRE, left_x);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X2_MAX_PRE, right_x);
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_9, tmpVal);
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_10);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y2_MIN_PRE, top_y);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y2_MAX_PRE, bottom_y);
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_10, tmpVal);
            break;
        case 3:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_11);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X3_MIN_PRE, left_x);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X3_MAX_PRE, right_x);
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_11, tmpVal);
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_12);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y3_MIN_PRE, top_y);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y3_MAX_PRE, bottom_y);
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_12, tmpVal);
            break;
        case 4:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_13);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X4_MIN_PRE, left_x);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X4_MAX_PRE, right_x);
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_13, tmpVal);
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_14);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y4_MIN_PRE, top_y);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y4_MAX_PRE, bottom_y);
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_14, tmpVal);
            break;
        case 5:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_15);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X5_MIN_PRE, left_x);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X5_MAX_PRE, right_x);
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_15, tmpVal);
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_16);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y5_MIN_PRE, top_y);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y5_MAX_PRE, bottom_y);
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_16, tmpVal);
            break;
        case 6:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_17);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X6_MIN_PRE, left_x);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X6_MAX_PRE, right_x);
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_17, tmpVal);
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_18);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y6_MIN_PRE, top_y);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y6_MAX_PRE, bottom_y);
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_18, tmpVal);
            break;
        case 7:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_19);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X7_MIN_PRE, left_x);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X7_MAX_PRE, right_x);
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_19, tmpVal);
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_20);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y7_MIN_PRE, top_y);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y7_MAX_PRE, bottom_y);
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_20, tmpVal);
            break;
    }
}

void ISP_WDR_Get_ROI_Position(int roi_id, int *left_x, int *right_x,
                                int *top_y, int *bottom_y)
{
    uint32_t tmpVal;

    switch(roi_id)
    {
        case 0:
            tmpVal  = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_5);
            *left_x = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X0_MIN_PRE);
            *right_x = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X0_MAX_PRE);
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_6);
            *top_y = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y0_MIN_PRE);
            *bottom_y = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y0_MAX_PRE);
            break;
        case 1:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_7);
            *left_x = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X1_MIN_PRE);
            *right_x = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X1_MAX_PRE);
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_8);
            *top_y = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y1_MIN_PRE);
            *bottom_y = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y1_MAX_PRE);
            break;
        case 2:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_9);
            *left_x = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X2_MIN_PRE);
            *right_x = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X2_MAX_PRE);
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_10);
            *top_y = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y2_MIN_PRE);
            *bottom_y = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y2_MAX_PRE);
            break;
        case 3:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_11);
            *left_x = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X3_MIN_PRE);
            *right_x = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X3_MAX_PRE);
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_12);
            *top_y = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y3_MIN_PRE);
            *bottom_y = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y3_MAX_PRE);
            break;
        case 4:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_13);
            *left_x = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X4_MIN_PRE);
            *right_x = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X4_MAX_PRE);
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_14);
            *top_y = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y4_MIN_PRE);
            *bottom_y = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y4_MAX_PRE);
            break;
        case 5:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_15);
            *left_x = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X5_MIN_PRE);
            *right_x = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X5_MAX_PRE);
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_16);
            *top_y = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y5_MIN_PRE);
            *bottom_y = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y5_MAX_PRE);
            break;
        case 6:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_17);
            *left_x = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X6_MIN_PRE);
            *right_x = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X6_MAX_PRE);
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_18);
            *top_y = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y6_MIN_PRE);
            *bottom_y = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y6_MAX_PRE);
            break;
        case 7:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_19);
            *left_x = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X7_MIN_PRE);
            *right_x = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_X7_MAX_PRE);
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_20);
            *top_y = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y7_MIN_PRE);
            *bottom_y = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_Y7_MAX_PRE);
            break;
    }
}

void ISP_WDR_Set_ROI_Weight(int roi_id, int weight)
{
    uint32_t tmpVal;

