bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp_wdr.c
    CHECK_PARAM_MAX(weight, ISP_WDR_ROI_WEIGHT_MAX);

    switch(roi_id)
    {
        case 0:
        case 1:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_1);
            if (roi_id & 0x01) {
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI1_WEIGHT_PRE, weight);
            } else {
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI0_WEIGHT_PRE, weight);
            }
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_1, tmpVal);
            break;
        case 2:
        case 3:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_2);
            if (roi_id & 0x01) {
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI3_WEIGHT_PRE, weight);
            } else {
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI2_WEIGHT_PRE, weight);
            }
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_2, tmpVal);
            break;
        case 4:
        case 5:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_3);
            if (roi_id & 0x01) {
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI5_WEIGHT_PRE, weight);
            } else {
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI4_WEIGHT_PRE, weight);
            }
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_3, tmpVal);
            break;
        case 6:
        case 7:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_4);
            if (roi_id & 0x01) {
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI7_WEIGHT_PRE, weight);
            } else {
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI6_WEIGHT_PRE, weight);
            }
            BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_4, tmpVal);
            break;
    }
}

void ISP_WDR_Get_ROI_Weight(int roi_id, int *weight)
{
    uint32_t tmpVal;

    CHECK_PARAM_MAX(*weight, ISP_WDR_ROI_WEIGHT_MAX);

    switch(roi_id)
    {
        case 0:
        case 1:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_1);
            if (roi_id & 0x01) {
                *weight = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI1_WEIGHT_PRE);
            } else {
                *weight = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI0_WEIGHT_PRE);
            }
            break;
        case 2:
        case 3:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_2);
            if (roi_id & 0x01) {
                *weight = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI3_WEIGHT_PRE);
            } else {
                *weight = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI2_WEIGHT_PRE);
            }
            break;
        case 4:
        case 5:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_3);
            if (roi_id & 0x01) {
                *weight = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI5_WEIGHT_PRE);
            } else {
                *weight = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI4_WEIGHT_PRE);
            }
            break;
        case 6:
        case 7:
            tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_HIST_4);
            if (roi_id & 0x01) {
                *weight = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI7_WEIGHT_PRE);
            } else {
                *weight = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_HIST_ROI6_WEIGHT_PRE);
            }
            break;
    }
}


int ISP_WDR_Get_Hist_Data(ISP_WDR_Hist_Data_Type *hist)
{
    uint32_t tmpVal;
    uint32_t buf_idx;
    uint32_t buf_addr;
    uint32_t w_cnt_idx_start;
    uint32_t w_cnt_idx_end;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_0);
    buf_idx = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_BLWDR_BUF_IDX_R);
    w_cnt_idx_start = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_BLWDR_W_CNT_R);

    if (0 == buf_idx) {
        buf_addr = ISP_BASE + ISP_BLBACK_REG_HIST0_0_OFFSET;
        hist->hist_bin[64] = BL_RD_REG(ISP_BASE, ISP_BLBACK_REG_HIST0_64);
    } else {
        buf_addr = ISP_BASE + ISP_BLBACK_REG_HIST1_0_OFFSET;
        hist->hist_bin[64] = BL_RD_REG(ISP_BASE, ISP_BLBACK_REG_HIST1_64);
    }

    /* copy all the histogram bin except for the last one */
    memcpy(&hist->hist_bin[0], (uint32_t*)buf_addr, 64);

    w_cnt_idx_end = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_BLWDR_W_CNT_R);
    if (w_cnt_idx_start != w_cnt_idx_end) {
        BL_LOGW("wdr statistics overwrite!");
        return -1;
    }

    return 0;
}

void ISP_WDR_Set_WDR_Curve_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_CURVE_33);
    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_BLBACK_CURVE_EN_PRE);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_BLBACK_CURVE_EN_PRE);
    }
    BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_CURVE_33, tmpVal);
}

void ISP_WDR_Get_WDR_Curve_State(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_CURVE_33);

    if (BL_IS_REG_BIT_SET(tmpVal, ISP_BLBACK_CURVE_EN_PRE)) {
        *state = ENABLE;
    } else {
        *state = DISABLE;
    }
}

void ISP_WDR_Set_WDR_Curve(const ISP_WDR_Curve_Type *wdr_curve)
{
    memcpy((uint32_t*)(ISP_BASE + ISP_BLBACK_WDR_CURVE_1_OFFSET), (uint32_t*)&wdr_curve->curve_coef[0], ISP_WDR_CURVE_COEF_NUM / 2);
}

void ISP_WDR_Get_WDR_Curve(ISP_WDR_Curve_Type *wdr_curve)
{
    memcpy((uint32_t*)&wdr_curve->curve_coef[0], (uint32_t*)(ISP_BASE + ISP_BLBACK_WDR_CURVE_1_OFFSET), ISP_WDR_CURVE_COEF_NUM / 2);
}

void ISP_WDR_Set_WDR_Curve_Weight(int weight)
{
    uint32_t tmpVal;

    CHECK_PARAM_MAX(weight, ISP_WDR_CURVE_WEIGHT_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_CURVE_33);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CURVE_WEIGHT_PRE, weight);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_CURVE_33, tmpVal);
}

void ISP_WDR_Get_WDR_Curve_Weight(int *weight)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_CURVE_33);
    *weight = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CURVE_WEIGHT_PRE);
}

void ISP_WDR_Get_Post_Enhance_State(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_ENH_1);

    if (BL_IS_REG_BIT_SET(tmpVal, ISP_BLBACK_ENH_EN_PRE)) {
        *state = ENABLE;
    } else {
        *state = DISABLE;
    }
}

void ISP_WDR_Set_Post_Enhance_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_ENH_1);
    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_BLBACK_ENH_EN_PRE);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_BLBACK_ENH_EN_PRE);
    }
    BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_ENH_1, tmpVal);
}

