bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp_wdr.c
void ISP_WDR_Set_Post_Enhance_Weight(int weight)
{
    uint32_t tmpVal;

    CHECK_PARAM_MAX(weight, ISP_WDR_POST_ENHANCE_WEIGHT_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_ENH_1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_ENH_WEIGHT_PRE, weight);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_ENH_1, tmpVal);
}

void ISP_WDR_Get_Post_Enhance_Weight(int *weight)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_ENH_1);
    *weight = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_ENH_WEIGHT_PRE);
}

void ISP_WDR_Set_Post_Enhance_Y_Offset(int y_offset)
{
    uint32_t tmpVal;

    CHECK_PARAM_MAX(y_offset, ISP_WDR_POST_ENHANCE_Y_OFFSET_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_ENH_1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_ENH_Y_OFFSET_PRE, y_offset);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_ENH_1, tmpVal);
}

void ISP_WDR_Get_Post_Enhance_Y_Offset(int *y_offset)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_ENH_1);
    *y_offset = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_ENH_Y_OFFSET_PRE);
}

void ISP_WDR_Set_Post_Enhance_Luma_Gain(int gain)
{
    uint32_t tmpVal;

    CHECK_PARAM_MAX(gain, ISP_WDR_POST_ENHANCE_Y_GAIN_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_ENH_2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_ENH_Y_GAIN_PRE, gain);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_ENH_2, tmpVal);
}

void ISP_WDR_Get_Post_Enhance_Luma_Gain(int *gain)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_ENH_2);
    *gain = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_ENH_Y_GAIN_PRE);
}

void ISP_WDR_Set_Post_Enhance_Chroma_Gain(int gain)
{
    uint32_t tmpVal;

    CHECK_PARAM_MAX(gain, ISP_WDR_POST_ENHANCE_C_GAIN_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_ENH_2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_ENH_C_GAIN_PRE, gain);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_WDR_ENH_2, tmpVal);
}

void ISP_WDR_Get_Post_Enhance_Chroma_Gain(int *gain)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_WDR_ENH_2);
    *gain = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_ENH_C_GAIN_PRE);
}

